app/controllers/comments_controller.rb

  def create
    @artilce = Article.find(params[:article_id])
    @comment = @artilce.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Rashed"], ["body", "Rashed Was here saying hi"], ["article_id", 1], ["created_at", "2024-09-02 00:28:06.466687"], ["updated_at", "2024-09-02 00:28:06.466687"]]